brzk4/Modbus-slave-STM8s/Libraries/STM8_TouchSensing_Driver/src/stm8l10x_tsl_ct_acquisition.c
#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 2
CONST u8 Table_SCKEY_P3[SCKEY_P3_KEY_COUNT] =
  {

#if   (SCKEY_P3_A == GROUP1)
    0x00
#elif (SCKEY_P3_A == GROUP2)
    0x01
#elif (SCKEY_P3_A == GROUP3)
    0x02
#elif (SCKEY_P3_A == GROUP4)
    0x03
#elif (SCKEY_P3_A == GROUP5)
    0x04
#elif (SCKEY_P3_A == GROUP6)
    0x05
#elif (SCKEY_P3_A == GROUP7)
    0x06
#elif (SCKEY_P3_A == GROUP8)
    0x07
#endif

#if SCKEY_P3_KEY_COUNT > 1
#if   (SCKEY_P3_B == GROUP1)
    , 0x00
#elif (SCKEY_P3_B == GROUP2)
    , 0x01
#elif (SCKEY_P3_B == GROUP3)
    , 0x02
#elif (SCKEY_P3_B == GROUP4)
    , 0x03
#elif (SCKEY_P3_B == GROUP5)
    , 0x04
#elif (SCKEY_P3_B == GROUP6)
    , 0x05
#elif (SCKEY_P3_B == GROUP7)
    , 0x06
#elif (SCKEY_P3_B == GROUP8)
    , 0x07
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 2
#if   (SCKEY_P3_C == GROUP1)
    , 0x00
#elif (SCKEY_P3_C == GROUP2)
    , 0x01
#elif (SCKEY_P3_C == GROUP3)
    , 0x02
#elif (SCKEY_P3_C == GROUP4)
    , 0x03
#elif (SCKEY_P3_C == GROUP5)
    , 0x04
#elif (SCKEY_P3_C == GROUP6)
    , 0x05
#elif (SCKEY_P3_C == GROUP7)
    , 0x06
#elif (SCKEY_P3_C == GROUP8)
    , 0x07
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 3
#if   (SCKEY_P3_D == GROUP1)
    , 0x00
#elif (SCKEY_P3_D == GROUP2)
    , 0x01
#elif (SCKEY_P3_D == GROUP3)
    , 0x02
#elif (SCKEY_P3_D == GROUP4)
    , 0x03
#elif (SCKEY_P3_D == GROUP5)
    , 0x04
#elif (SCKEY_P3_D == GROUP6)
    , 0x05
#elif (SCKEY_P3_D == GROUP7)
    , 0x06
#elif (SCKEY_P3_D == GROUP8)
    , 0x07
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 4
#if   (SCKEY_P3_E == GROUP1)
    , 0x00
#elif (SCKEY_P3_E == GROUP2)
    , 0x01
#elif (SCKEY_P3_E == GROUP3)
    , 0x02
#elif (SCKEY_P3_E == GROUP4)
    , 0x03
#elif (SCKEY_P3_E == GROUP5)
    , 0x04
#elif (SCKEY_P3_E == GROUP6)
    , 0x05
#elif (SCKEY_P3_E == GROUP7)
    , 0x06
#elif (SCKEY_P3_E == GROUP8)
    , 0x07
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 5
#if   (SCKEY_P3_F == GROUP1)
    , 0x00
#elif (SCKEY_P3_F == GROUP2)
    , 0x01
#elif (SCKEY_P3_F == GROUP3)
    , 0x02
#elif (SCKEY_P3_F == GROUP4)
    , 0x03
#elif (SCKEY_P3_F == GROUP5)
    , 0x04
#elif (SCKEY_P3_F == GROUP6)
    , 0x05
#elif (SCKEY_P3_F == GROUP7)
    , 0x06
#elif (SCKEY_P3_F == GROUP8)
    , 0x07
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 6
#if   (SCKEY_P3_G == GROUP1)
    , 0x00
#elif (SCKEY_P3_G == GROUP2)
    , 0x01
#elif (SCKEY_P3_G == GROUP3)
    , 0x02
#elif (SCKEY_P3_G == GROUP4)
    , 0x03
#elif (SCKEY_P3_G == GROUP5)
    , 0x04
#elif (SCKEY_P3_G == GROUP6)
    , 0x05
#elif (SCKEY_P3_G == GROUP7)
    , 0x06
#elif (SCKEY_P3_G == GROUP8)
    , 0x07
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 7
#if   (SCKEY_P3_H == GROUP1)
    , 0x00
#elif (SCKEY_P3_H == GROUP2)
    , 0x01
#elif (SCKEY_P3_H == GROUP3)
    , 0x02
#elif (SCKEY_P3_H == GROUP4)
    , 0x03
#elif (SCKEY_P3_H == GROUP5)
    , 0x04
#elif (SCKEY_P3_H == GROUP6)
    , 0x05
#elif (SCKEY_P3_H == GROUP7)
    , 0x06
#elif (SCKEY_P3_H == GROUP8)
    , 0x07
#endif
#endif
  };
#endif

/* Table_SCKEY_BITS contents the individual masks for the port acquisitions */
#if NUMBER_OF_SINGLE_CHANNEL_KEYS > 0
CONST u8 Table_SCKEY_BITS[
  SCKEY_P1_KEY_COUNT
#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 1
  + SCKEY_P2_KEY_COUNT
#endif
#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 2
  + SCKEY_P3_KEY_COUNT
#endif
] =
  {
    SCKEY_P1_A /* Always defined */
#if SCKEY_P1_KEY_COUNT > 1
    , SCKEY_P1_B
#endif
#if SCKEY_P1_KEY_COUNT > 2
    , SCKEY_P1_C
#endif
#if SCKEY_P1_KEY_COUNT > 3
    , SCKEY_P1_D
#endif
#if SCKEY_P1_KEY_COUNT > 4
    , SCKEY_P1_E
#endif
#if SCKEY_P1_KEY_COUNT > 5
    , SCKEY_P1_F
#endif
#if SCKEY_P1_KEY_COUNT > 6
    , SCKEY_P1_G
#endif
#if SCKEY_P1_KEY_COUNT > 7
    , SCKEY_P1_H
#endif

#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 1
    , SCKEY_P2_A
#if SCKEY_P2_KEY_COUNT > 1
    , SCKEY_P2_B
#endif
#if SCKEY_P2_KEY_COUNT > 2
    , SCKEY_P2_C
#endif
#if SCKEY_P2_KEY_COUNT > 3
    , SCKEY_P2_D
#endif
#if SCKEY_P2_KEY_COUNT > 4
    , SCKEY_P2_E
#endif
#if SCKEY_P2_KEY_COUNT > 5
    , SCKEY_P2_F
#endif
#if SCKEY_P2_KEY_COUNT > 6
    , SCKEY_P2_G
#endif
#if SCKEY_P2_KEY_COUNT > 7
    , SCKEY_P2_H
#endif
#endif

#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 2
    , SCKEY_P3_A
#if SCKEY_P3_KEY_COUNT > 1
    , SCKEY_P3_B
#endif
#if SCKEY_P3_KEY_COUNT > 2
    , SCKEY_P3_C
#endif
#if SCKEY_P3_KEY_COUNT > 3
    , SCKEY_P3_D
#endif
#if SCKEY_P3_KEY_COUNT > 4
    , SCKEY_P3_E
#endif
#if SCKEY_P3_KEY_COUNT > 5
    , SCKEY_P3_F
#endif
#if SCKEY_P3_KEY_COUNT > 6
    , SCKEY_P3_G
#endif
#if SCKEY_P3_KEY_COUNT > 7
    , SCKEY_P3_H
#endif
#endif
  };
#endif

#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0
CONST u16 Table_MCKEY_PORTS[
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 1
  CHANNEL_PER_MCKEY
#endif
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 2
  CHANNEL_PER_MCKEY + CHANNEL_PER_MCKEY
#endif
] =
  {
    MCKEY1_A_CH
    , MCKEY1_B_CH
    , MCKEY1_C_CH
#if CHANNEL_PER_MCKEY > 3
    , MCKEY1_D_CH
    , MCKEY1_E_CH
#endif
#if CHANNEL_PER_MCKEY > 5
    , MCKEY1_F_CH
    , MCKEY1_G_CH
    , MCKEY1_H_CH
#endif
#if NUMBER_OF_MULTI_CHANNEL_KEYS > 1
    , MCKEY2_A_CH
    , MCKEY2_B_CH
    , MCKEY2_C_CH
#if CHANNEL_PER_MCKEY > 3
    , MCKEY2_D_CH
    , MCKEY2_E_CH
#endif
#if CHANNEL_PER_MCKEY > 5
    , MCKEY2_F_CH
    , MCKEY2_G_CH
    , MCKEY2_H_CH
#endif
#endif
  };
#endif

#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0
CONST u8 Table_MCKEY_BITS[
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 1
  CHANNEL_PER_MCKEY
#endif
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 2
  CHANNEL_PER_MCKEY + CHANNEL_PER_MCKEY
#endif
] =
  {
    MCKEY1_A
    , MCKEY1_B
    , MCKEY1_C
#if CHANNEL_PER_MCKEY > 3
    , MCKEY1_D
    , MCKEY1_E
#endif
#if CHANNEL_PER_MCKEY > 5
    , MCKEY1_F
    , MCKEY1_G
    , MCKEY1_H
#endif
#if NUMBER_OF_MULTI_CHANNEL_KEYS > 1
    , MCKEY2_A
    , MCKEY2_B
    , MCKEY2_C
#if CHANNEL_PER_MCKEY > 3
    , MCKEY2_D
    , MCKEY2_E
#endif
#if CHANNEL_PER_MCKEY > 5
    , MCKEY2_F
    , MCKEY2_G
    , MCKEY2_H
#endif
#endif
  };
#endif


/* Basic delay function*/
void wait(u16 d)
{
  while (d--) {}}

#if SPREAD_SPECTRUM
/**
  ******************************************************************************
  * @brief Spread Spectrum waiting routine. A variable delay is
  * inserted between each step.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * SPREAD_SPECTRUM must be defined in the configuration file
  ******************************************************************************
  */
INLINE void TSL_SW_Spread_Spectrum(void)
{
  u8 i;

