brzk4/Modbus-slave-STM8s/Libraries/STM8_TouchSensing_Driver/src/stm8l10x_tsl_ct_acquisition.c
    /*open the analog switches to allow checking of the inputs*/
    COMP->CCS &= (u8)(~(SAMP_CAP_COMP_MASK | P2_COMP_MASK));

    /*Sampling capacitor IOs in input folating */
#ifdef PROTECT_IO_ACCESS
    disableInterrupts();
#endif
    SAMP_CAP_PORT->DDR &= (u8)(~(SAMP_CAP_IO_MASK));
    SAMP_CAP_PORT->CR1 &= (u8)(~(SAMP_CAP_IO_MASK));
#ifdef PROTECT_IO_ACCESS
    enableInterrupts();
#endif

    if ((Channel_P2.State.b.Grp1 == 0) && ((SAMP_CAP_PORT->IDR&SAMP_CAP_IO_MASK_1) == SAMP_CAP_IO_MASK_1))
    {
      Channel_P2.Measure[0] += MeasurementCounter;
      Channel_P2.State.whole |= Group1;
    }
    if ((Channel_P2.State.b.Grp2 == 0) && ((SAMP_CAP_PORT->IDR&SAMP_CAP_IO_MASK_2) == SAMP_CAP_IO_MASK_2))
    {
      Channel_P2.Measure[1] += MeasurementCounter;
      Channel_P2.State.whole |= Group2;
    }

    /*it's better to implement this like that because it's much more faster than to put this test in the "while test" below  and only the MSByte is tested in order to speed up the code execution*/
    if ((u8)(MeasurementCounter >> 8) > (u8)(MaxAcqNumber >> 8))
    {
      break;
    }
  }
  while (((Channel_P2.State.whole & Channel_P2.EnabledChannels) != Channel_P2.EnabledChannels));
}
#endif


/**
  ******************************************************************************
  * @brief Acquisition function for the 3rd Channel IO of each group
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  ******************************************************************************
  */
#if (NUMBER_OF_ACQUISITION_PORTS > 2)
void TSL_IO_Acquisition_P3(u16 MaxAcqNumber)
{

  u16 MeasurementCounter;

  /*reset the counter values*/
  MeasurementCounter = 0x0000;
  Channel_P3.Measure[0] = 0x0000;
  Channel_P3.Measure[1] = 0x0000;
  Channel_P3.State.whole = 0x00;

  /*open the analog switches*/
  COMP->CCS &= (u8)(~(SAMP_CAP_COMP_MASK | P3_COMP_MASK));

  /*All IO to pushpull LOW for discharging all capacitors (Ctouch and Csense)*/
  /*discharging Csample*/
#ifdef PROTECT_IO_ACCESS
  disableInterrupts();
#endif
  SAMP_CAP_PORT->DDR |= SAMP_CAP_IO_MASK;
  SAMP_CAP_PORT->CR1 |= SAMP_CAP_IO_MASK;
  SAMP_CAP_PORT->ODR &= (u8)(~(SAMP_CAP_IO_MASK));
  /*discharging Ctouch*/
  P3_PORT->DDR |= P3_IO_MASK;
  P3_PORT->CR1 |= P3_IO_MASK;
  P3_PORT->ODR &= (u8)(~(P3_IO_MASK));
#ifdef PROTECT_IO_ACCESS
  enableInterrupts();
#endif

  /*wait a while for good discharge of all capacitors*/
  wait(200);

  /*All IO in input floating*/
#ifdef PROTECT_IO_ACCESS
  disableInterrupts();
#endif
  P3_PORT->DDR &= (u8)(~(P3_IO_MASK));
  P3_PORT->CR1 &= (u8)(~(P3_IO_MASK));
#ifdef PROTECT_IO_ACCESS
  enableInterrupts();
#endif

  //close the Chanel #1 analog switches (COMP1 CHA and COMP2 CH1 ie PB0 and PB2)
  COMP->CCS |= SAMP_CAP_COMP_MASK;

  /*loop in this loop while all the 1st channel of each group have not reach the VIH level*/
  do
  {
    /*Close the sampling capacitor analog switch*/
    COMP->CCS |= SAMP_CAP_COMP_MASK;
    /*charging Ctouch with connecting the IO to Vdd (io in push-pull HIGH)*/
#ifdef PROTECT_IO_ACCESS
    disableInterrupts();
#endif
    P3_PORT->DDR |= P3_IO_MASK;//output push pull config
    P3_PORT->CR1 |= P3_IO_MASK;
    P3_PORT->ODR |= P3_IO_MASK; //HIGH level
#ifdef PROTECT_IO_ACCESS
    enableInterrupts();
#endif

    /*wait a while for good charging*/
    CLWHTA; //wait(5);

    /*All IO in input */
#ifdef PROTECT_IO_ACCESS
    disableInterrupts();
#endif
    P3_PORT->DDR &= (u8)(~(P3_IO_MASK));
    P3_PORT->CR1 &= (u8)(~(P3_IO_MASK));
#ifdef PROTECT_IO_ACCESS
    enableInterrupts();
#endif

    /*increment the MeasurementCounter*/
    MeasurementCounter++;

    /*charging the Csense cap with connecting it to Ctouch by closing the analog switch*/
    COMP->CCS |= P3_COMP_MASK;
    /*wait a while for good charge transfering*/
    CLWLTA; //wait(5);

#if SPREAD_SPECTRUM
    TSL_SW_Spread_Spectrum();
#endif

    /*open the analog switches to allow checking of the inputs*/
    COMP->CCS &= (u8)(~(SAMP_CAP_COMP_MASK | P3_COMP_MASK));

    /*Sampling capacitor IOs in input folating */
#ifdef PROTECT_IO_ACCESS
    disableInterrupts();
#endif
    SAMP_CAP_PORT->DDR &= (u8)(~(SAMP_CAP_IO_MASK));
    SAMP_CAP_PORT->CR1 &= (u8)(~(SAMP_CAP_IO_MASK));
#ifdef PROTECT_IO_ACCESS
    enableInterrupts();
#endif

    if ((Channel_P3.State.b.Grp1 == 0) && ((SAMP_CAP_PORT->IDR&SAMP_CAP_IO_MASK_1) == SAMP_CAP_IO_MASK_1))
    {
      Channel_P3.Measure[0] += MeasurementCounter;
      Channel_P3.State.whole |= Group1;
    }
    if ((Channel_P3.State.b.Grp2 == 0) && ((SAMP_CAP_PORT->IDR&SAMP_CAP_IO_MASK_2) == SAMP_CAP_IO_MASK_2))
    {
      Channel_P3.Measure[1] += MeasurementCounter;
      Channel_P3.State.whole |= Group2;
    }
    /*it's better to implement this like that because it's much more faster than to put this test in the "while test" below and only the MSByte is tested in order to speed up the code execution*/
    if ((u8)(MeasurementCounter >> 8) > (u8)(MaxAcqNumber >> 8))
    {
      break;
    }
  }
  while (((Channel_P3.State.whole & Channel_P3.EnabledChannels) != Channel_P3.EnabledChannels));

}
#endif


#endif

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
